{"name":"Ahmed Ali","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Ahmed Ali ","headerTaglineThree":"Software Engineer | Frontend Developer | React.js & Next.js Specialist","headerTaglineFour":"","showCursor":true,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/ahmedalifarhan"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/ahmed-ali-51736222a/"},{"id":"5","title":"Email","link":"mailto:ahmed.ali.farhan.soliman@gmail.com"},{"id":"be18eb91-468c-477a-b056-24a9e820146a","title":"WhatsApp","link":"https://wa.me/201155529025"},{"id":"4f7f33b2-d1fc-490b-8908-552a2f78675c","title":"Phone Call","link":"tel:+201155529025"}],"projects":[{"id":"1","title":"Frontend Developer | Hatley – React.js Order Delivery Platform","description":"•Tools Used: React.js, TypeScript, Tailwind CSS, bootstrap Redux, Swagger API.                                                     •Problem Solved: Improved delivery efficiency in Egypt by enabling real-time bidding between delivery providers, reducing costs and optimizing order fulfillment. ","imageSrc":"https://www.raed.net/img?id=1250275","url":"https://hatley.vercel.app/home"},{"id":"2","title":"Smart Login Form UI","description":"A modern and responsive login form built with Next.js, Tailwind CSS, Redux, and React.","imageSrc":"https://www.raed.net/img?id=1250323","url":"https://yeshtery-login-ahmed-ali-farhan.vercel.app/login"},{"id":"3","title":"E-Commerce Lite","description":"A simple e-commerce platform with sorting features, state management using Redux, and built with React for a seamless user experience.","imageSrc":"https://www.raed.net/img?id=1250339","url":"https://ecommercemomentum-assignment.vercel.app/"},{"id":"4","title":"Task Manager Pro","description":"A task management app built with React.js, featuring task completion tracking, priority classification, and editing capabilities to enhance productivity.","imageSrc":"https://www.raed.net/img?id=1250343","url":"https://ahmedalifarhans-projects-netway-corp-assignment-task-manager.vercel.app/"},{"id":"5","title":"Interactive UI Design in Figma","description":"Designed and developed interactive and intuitive user interfaces using Figma, ensuring a seamless user experience. My work includes UI designs for both users and service providers, focusing on usability, aesthetics, and business requirements.","imageSrc":"https://www.raed.net/img?id=1250275","url":"https://www.figma.com/file/m4MKiBbjtKAwz52fKGZpqJ/Hatley"},{"id":"6","title":"Interactive E-Menu System","description":"Designed and developed a full-stack .NET MVC electronic menu system, enhancing restaurant operations with an interactive digital menu. The system allows users to browse, customize, and order items seamlessly, while administrators can manage menu items in real time. Features include dynamic item updates, user customization, and a smooth ordering experience.","imageSrc":"https://www.raed.net/img?id=1250346","url":"http://e-menu.runasp.net/"},{"id":"046b0e4c-0a0f-4a03-bb1f-01956e28ad87","title":"Leon Template – Sleek & Modern Web Design","description":" Tools Used: HTML, CSS, JavaScript, Bootstrap. • Date: Oct 2023 • Project Type: A visually appealing and fully responsive portfolio template designed for freelancers and creative agencies. Features include smooth animations, interactive elements, and a structured layout to showcase projects effectively.","imageSrc":"https://www.raed.net/img?id=1250353","url":"https://ahmedalifarhan.github.io/My_Third_Tempelet_html_css/"},{"id":"fc275afc-bf7b-451c-82b6-96a44f7bbf90","title":"Multi-Service Web Interface","description":"• Tools Used: HTML, CSS, JavaScript • Project Type: A web front-end interface featuring multiple services, designed with a focus on clean UI, responsiveness, and user engagement. Specialized in transforming UI/UX designs into interactive and visually appealing experiences.","imageSrc":"https://www.raed.net/img?id=1250349","url":"https://ahmedalifarhan.github.io/My_Second_Tempelet_html_css/"},{"id":"e08108c2-fb25-49a9-b6cf-c77efa6f1a48","title":"My Special Design – Customizable UI Component Library","description":"Tools Used: HTML, CSS, JavaScript, Tailwind CSS, Bootstrap, GSAP (for animations). • Project Type: A fully customizable UI component library designed to enhance development efficiency. The project includes a collection of pre-built, reusable components with responsive design, smooth animations, and theme customization options to streamline UI/UX workflows.","imageSrc":"https://www.raed.net/img?id=1250356","url":"https://ahmedalifarhan.github.io/HTML--CSS--JavaScript--BootStrap-Design/"},{"id":"184b001c-dc40-4385-a914-37df16a0e77e","title":"Leon – Super Creative & Minimal Agency Web Template","description":"Tools Used: HTML, CSS, JavaScript, Bootstrap. • Project Type: A sleek and modern agency website template designed for creative professionals. Features include a fully responsive layout, smooth animations, and a minimalist aesthetic to enhance brand presentation and user engagement.","imageSrc":"https://www.raed.net/img?id=1250357","url":"https://ahmedalifarhan.github.io/My_First_Tempelet_html_css/"},{"id":"8f146d70-7728-475d-adb5-be73b740c6f6","title":"Choose Your Plan – Responsive Service Selection UI","description":"Tools Used: HTML, CSS, JavaScript (Vanilla). • Project Type: A dynamic and responsive front-end interface for service selection. Designed without any frameworks, this project features interactive UI elements, smooth transitions, and a user-friendly layout to enhance the browsing experience.","imageSrc":"https://www.raed.net/img?id=1250360","url":"https://ahmedalifarhan.github.io/HTML--CSS--JavaScript--Responsive-Design-Dynamic-without-any-Framwork/"},{"id":"37ef29f4-9f9e-40a6-b99b-97724116ab86","title":"UI/UX to Front-End Implementation","description":" Tools Used: HTML, CSS, JavaScript (Vanilla). • Project Type: A front-end implementation project focused on converting UI/UX designs into fully responsive and interactive web interfaces. This project showcases expertise in creating visually appealing layouts while ensuring optimal user experience across devices.","imageSrc":"https://www.raed.net/img?id=1250364","url":"https://ahmedalifarhan.github.io/My_Fourth_Tempelet_HTML_CSS_JavaScript/"}],"services":[{"id":"4","title":"1️⃣ Front-End Development","description":"🔹Building interactive and responsive web applications using React.js, Next.js, JavaScript, TypeScript, Tailwind CSS.\nEnsuring smooth user experiences across all devices."},{"id":"82933943-d647-43d7-99d7-3c15c7363890","title":"2️⃣ UI/UX Design to Code","description":"🔹Converting Figma, Adobe XD, and Sketch designs into clean, pixel-perfect code using HTML, CSS, JavaScript, Tailwind CSS.\n"},{"id":"42b3db32-56a4-4671-bab7-e8c851f1b809","title":"3️⃣ Admin Dashboards Development","description":"🔹Creating professional, user-friendly admin dashboards with React.js, Redux, Ant Design, and Material-UI.\n"},{"id":"3c2910d4-ba93-4fe4-8135-572bd00b5201","title":"4️⃣ Website Performance Optimization","description":"🔹Enhancing website speed and responsiveness by following best practices like Lighthouse and Web Vitals.\n"},{"id":"7eb4c038-8509-43fa-9cef-b47484377120","title":"5️⃣ API Integration & Cloud Services","description":"🔹Connecting front-end applications with RESTful APIs and GraphQL using Axios and Swagger.\n"},{"id":"00441c45-0441-43b7-9abf-82d4c209d66c","title":"6️⃣ Feature Enhancements & Bug Fixes","description":"🔹Improving existing projects by adding new features, refactoring code, and fixing bugs.\n"},{"id":"a0a6c18d-345f-4acd-a142-8721962090c4","title":"7️⃣ Back-End Development","description":"🔹 Developing scalable and efficient server-side applications using .NET MVC and Java.\n\n\n🔹 Creating and optimizing RESTful APIs & GraphQL for seamless front-end integration.\n\n🔹 Implementing authentication and security best practices using JWT, OAuth, and Identity Framework.\n\n"},{"id":"d90f99ad-1014-47b4-b79c-fa21b2d6d157","title":"8️⃣ Full-Stack Web Application Development","description":" Building complete web applications with React.js (front-end) and .NET MVC/Java (back-end).\n🔹 Developing and managing SQL Server, MongoDB databases with optimized performance.\n🔹 Ensuring end-to-end functionality, from UI to database management."},{"id":"ef0e131c-933c-492c-8bdc-ae077e62f315","title":"9️⃣ Performance Optimization & Debugging","description":"Enhancing website speed and responsiveness using Lighthouse & Web Vitals.\n🔹 Debugging and fixing front-end and back-end issues for optimal performance.\n🔹 Writing clean, maintainable, and scalable code following best practices."},{"id":"f98502fc-59e7-4b50-806e-5f02265954f3","title":"🔟 Maintenance, Updates, and Feature Enhancements","description":"🔹 Improving and refactoring existing projects for better performance.\n🔹 Adding new features and functionalities based on user requirements.\n🔹 Providing ongoing support and updates for web applications."}],"aboutpara":"👨‍🎓 Software Engineer | Front-End Developer | React & Next.js Enthusiast\n\nI am a passionate Software Engineer specializing in front-end development with expertise in React.js, Next.js, JavaScript, and TypeScript. \nI focus on building high-performance, scalable, and user-friendly web applications that enhance user experience and meet business goals.\n\n🔹 Key Skills & Expertise:\n\n✔️ React.js & Next.js – Building server-side rendered (SSR) and static web applications for better performance and SEO.\n\n✔️ Back-End Development – Proficient in .NET MVC and Java, designing scalable and efficient server-side applications.\n✔️ JavaScript & TypeScript – Writing clean, efficient, and maintainable code.\n✔️ State Management – Experience with Redux, Context API for efficient data handling.\n✔️ UI/UX Optimization – Ensuring smooth and responsive interfaces with Tailwind CSS & Bootstrap.\n✔️ API Integration – Connecting front-end applications with RESTful APIs & GraphQL.\n\n🎓 Education\n\nI hold a Bachelor’s degree in Computer Science from Assiut University (2020 – 2024), where I gained a strong foundation in software development, \ndata structures, algorithms, and problem-solving.\n\nThroughout my studies, I specialized in front-end development, working extensively with React.js, Next.js, JavaScript, and TypeScript. \nI also developed skills in object-oriented programming (OOP), databases (SQL, MongoDB), and software engineering principles.\n\nMy university experience allowed me to work on multiple projects, collaborate with teams, and continuously improve my technical and problem-solving skills, \npreparing me for a dynamic career in software engineering.\n\n💡 Current Role & Passion\n\nCurrently, I work at iSchool & Megaminds, teaching and mentoring students in programming and web development. I am passionate about sharing knowledge, \nlearning new technologies, and contributing to innovative projects that make an impact.","resume":{"tagline":"Software Engineer | Frontend Developer | React.js & Next.js Specialist","description":"Frontend Software Engineer with over two years of experience in building scalable, high-performance web applications. Skilled in React.js, Next.js, JavaScript, and TypeScript, with expertise in UI/UX principles, accessibility, and responsive design. Experienced in performance optimization, API integration, and modern frontend architectures. Passionate about creating intuitive, efficient, and maintainable web solutions. Strong problem-solving skills and a team-oriented mindset, thriving in Agile development environments.","experiences":[],"education":{"universityName":"Assiut University","universityDate":"2020-2024","universityPara":"Bachelor’s Degree in Computer Science and Information"},"languages":["Javascript","HTML5","CSS","Java","C#","C++"],"frameworks":["React","Typescript","Next.js"],"others":["Figma","AWS"]}}